namespace AnotherTask.Enums
{
    enum JobPosition
    {
        Генеральный_директор, // Тимур: в подчинении - Рашид, Ильхам
        Финансовый_директор, // Рашид: в подчинении - Лукас
        Директор_по_автоматизации, // О. Ильхам: в подчинении - Оркадий, Ильшат, Володя
        Главный_бухгалтер, // Лукас
        Начальник_инф_систем, // Оркадий: Сергей, Ильшат
        Зам_начальника_инф_систем, // Володя: Сергей, Ильшат
        Главный_системщиков, // Ильшат: Иваныч
        Зам_главного_системщиков, // Иваныч: системщикам
        Системщики, // Илья, Витя, Женя
        Главный_разработчиков, // Сергей: Ляйсан
        Зам_главного_разработчиков, // Ляйсан: разработчикам
        Разработчики // Марат, Дина, Ильдар, Антон
    }
}
